[
    {
        "bookId": 1,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.ibb.co/RvgRMd6/Great-Gatsby.png",
        "review": "The Great Gatsby, set in the Jazz Age of the 1920s, is a timeless classic that delves into themes of wealth, love, and the American Dream. Fitzgerald's elegant prose captures the allure and decadence of the era through the eyes of narrator Nick Carraway. The tragic story of Jay Gatsby's unrequited love for Daisy Buchanan unfolds with a mix of glamour and melancholy, leaving readers pondering the price of ambition and the illusions of success. With its vivid characters and evocative setting, The Great Gatsby continues to resonate with readers, offering insights into the complexities of human desires and the pursuit of happiness.",
        "totalPages": 218,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Romance", "Drama", "Classic"],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 2,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.ibb.co/8b7XJ6N/To-Kill-A-Mockingbird-Book-Cover-2022-Nnon-Oo-M.png",
        "review": "To Kill a Mockingbird is a powerful portrayal of racial injustice and moral growth set in the Deep South during the 1930s. Through the innocent eyes of Scout Finch, readers witness the trial of Tom Robinson, a black man falsely accused of assaulting a white woman. Harper Lee's masterpiece explores themes of empathy, compassion, and the consequences of prejudice with a timeless relevance. The enduring impact of Atticus Finch's courage and integrity resonates as a beacon of hope in the face of social injustice. To Kill a Mockingbird remains a poignant reminder of the importance of standing up for what is right, even in the face of adversity.",
        "totalPages": 281,
        "rating": 4.8,
        "category": "Fiction",
        "tags": ["Social Justice", "Coming of Age", "Southern Literature"],
        "publisher": "J.B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 3,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://i.ibb.co/9YpK8h5/96c04761d81fb8be397622678e6821e5.jpg",
        "review": "1984 is a dystopian masterpiece that explores the dangers of totalitarianism and the erosion of individual freedom. Set in a bleak, oppressive world ruled by the omnipresent Party led by Big Brother, the novel follows Winston Smith as he rebels against the regime's pervasive surveillance and propaganda. George Orwell's chilling vision of a society where truth is manipulated and dissent is punished remains alarmingly relevant in today's world of mass surveillance and political manipulation. 1984 serves as a stark warning against the dangers of unchecked power and the importance of safeguarding liberty and truth.",
        "totalPages": 328,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["Dystopian", "Political", "Classic"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 4,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://i.ibb.co/cJSYZ1X/597fb48556f2d63ae86cb49197d0b477.jpg",
        "review": "The Catcher in the Rye is a seminal coming-of-age novel that follows the disillusioned teenager Holden Caulfield as he navigates the challenges of adolescence and the hypocrisy of adult society. J.D. Salinger's iconic protagonist rebels against the phoniness and superficiality he perceives in the world around him, grappling with feelings of alienation and isolation. Through Holden's introspective journey, Salinger captures the angst and existential struggles of youth with a raw and authentic voice that continues to resonate with readers across generations. The Catcher in the Rye remains a timeless exploration of teenage angst and the search for authenticity amidst a conformist society.",
        "totalPages": 277,
        "rating": 4.4,
        "category": "Fiction",
        "tags": ["Coming of Age", "Teenage Angst", "Classic"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 5,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://i.ibb.co/nQ9Trhp/pride-and-prejudice-9781499806250-lg.jpg",
        "review": "Pride and Prejudice is a timeless romance novel that explores the complexities of love, class, and societal expectations in Georgian England. Jane Austen's masterpiece follows the spirited Elizabeth Bennet as she navigates the intricacies of 19th-century courtship and grapples with her own prejudices and misconceptions. Against the backdrop of balls, gossip, and family drama, Austen crafts a witty and insightful commentary on the constraints faced by women in a patriarchal society. The enduring appeal of Pride and Prejudice lies in its memorable characters, sparkling dialogue, and timeless themes of love and social convention.",
        "totalPages": 279,
        "rating": 4.7,
        "category": "Fiction",
        "tags": ["Romance", "Satire", "Classic"],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 6,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/qNJhvJT/8e10a1ad7be48784932be1695b097d42.jpg",
        "review": "The Hobbit, or There and Back Again, is a charming and adventurous tale that introduces readers to the enchanting world of Middle-earth. J.R.R. Tolkien's classic fantasy follows the reluctant hero Bilbo Baggins as he embarks on a perilous journey to reclaim the lost treasure of the dwarf kingdom Erebor. Along the way, Bilbo encounters trolls, goblins, elves, and dragons, forging unlikely friendships and discovering his own courage and resourcefulness. With its rich world-building, memorable characters, and timeless themes of heroism and friendship, The Hobbit continues to captivate readers of all ages, serving as a beloved prelude to Tolkien's epic masterpiece, The Lord of the Rings.",
        "totalPages": 310,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": ["Adventure", "Quest", "Classic"],
        "publisher": "Allen & Unwin",
        "yearOfPublishing": 1937
    },
    {
        "bookId": 7,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "image": "https://i.ibb.co/kSmzWKs/58720f734bb291e1f12b7b233e60114c.jpg",
        "review": "The Alchemist is a profound allegorical novel that follows the journey of Santiago, a young Andalusian shepherd boy, as he embarks on a quest to fulfill his personal legend. Paulo Coelho's timeless tale explores themes of destiny, self-discovery, and the pursuit of one's dreams. Santiago's odyssey takes him from the tranquil countryside of Spain to the bustling markets of Tangier and the vast deserts of Egypt, where he encounters mentors, omens, and challenges that shape his understanding of life and purpose. With its simple yet profound wisdom, The Alchemist inspires readers to listen to their hearts and pursue their dreams with courage and determination.",
        "totalPages": 197,
        "rating": 4.7,
        "category": "Fiction",
        "tags": ["Philosophical", "Spiritual", "Adventure"],
        "publisher": "HarperCollins",
        "yearOfPublishing": 1988
    },
    {
        "bookId": 8,
        "bookName": "The Martian",
        "author": "Andy Weir",
        "image": "https://i.ibb.co/SnFJ66j/the-martian-iphone-12-pro-max.jpg",
        "review": "The Martian is a riveting science fiction novel that follows astronaut Mark Watney's struggle for survival after being stranded alone on Mars. Andy Weir's gripping narrative combines meticulous scientific detail with humor and suspense as Watney battles against the harsh Martian environment and dwindling resources. Through Watney's resourcefulness and ingenuity, Weir explores themes of resilience, teamwork, and the human spirit's capacity to overcome adversity. The Martian is a thrilling adventure that keeps readers on the edge of their seats, rooting for Watney's improbable odds of survival and celebrating the triumph of human ingenuity in the face of extraordinary challenges.",
        "totalPages": 369,
        "rating": 4.5,
        "category": "Science Fiction",
        "tags": ["Survival", "Space Exploration", "Adventure"],
        "publisher": "Crown Publishing Group",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 9,
        "bookName": "The Night Circus",
        "author": "Erin Morgenstern",
        "image": "https://i.ibb.co/K0pCyJV/1-4372683290.webp",
        "review": "The Night Circus is a mesmerizing fantasy novel that transports readers to a magical world of wonder and enchantment. Erin Morgenstern's lyrical prose weaves a tale of two young illusionists, Celia and Marco, bound by a magical competition set within a mysterious circus that only appears at night. As the competition unfolds, the circus becomes a stage for their extraordinary talents, captivating audiences with breathtaking performances and dazzling spectacles. Yet behind the glittering facade lies a deep and intricate web of secrets, love, and sacrifice. The Night Circus is a spellbinding journey into the realms of imagination, where dreams and reality intertwine in a breathtaking spectacle.",
        "totalPages": 387,
        "rating": 4.6,
        "category": "Fantasy",
        "tags": ["Magic", "Romance", "Mystery"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2011
    }
]
    